W5D2/reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    # @subs = Sub.all
    # @post.sub_id = current_user.subs.find(params[:id])
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @post = current_user.posts.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 8], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "sub_id" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["title", "checking post"], ["url", "checking.........."], ["content", "I am happy"], ["sub_id", 3], ["updated_at", "2019-07-09 20:26:13.715099"], ["id", 8]]

  def destroy
    @post = current_user.subs.find(params[:id]).posts.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]