W5D2/reddit_clone/app/views/posts/new.html.erb

  <input type="hidden" name="post[sub_id][]" value="">
  <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"